Revit 2024 API
BuiltInFailures.ViewFailures.InitialViewDeleted Property
 The starting view for the project has been deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InitialViewDeleted { get; }
Visual Basic
Public Shared ReadOnly Property InitialViewDeleted As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InitialViewDeleted {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace